In [2]:
print('ok')

ok

In [5]:
import mysql.connector

# Connect to MySQL server
try:
    connection = mysql.connector.connect(
        host="localhost",         # Replace with your MySQL host
        user="root",              # Replace with your MySQL username
        password="Susant@123456"  # Replace with your MySQL password
    )

    if connection.is_connected():
        print("Successfully connected to MySQL server")

    # Create a cursor object
    cursor = connection.cursor()


except mysql.connector.Error as err:
    print(f"Error: {err}")

Successfully connected to MySQL server

In [8]:
# Create database
cursor.execute("CREATE DATABASE IF NOT EXISTS students_db")
cursor.execute("USE students_db")

cursor.execute("""
CREATE TABLE IF NOT EXISTS students (
    id INT AUTO_INCREMENT PRIMARY KEY,
    name VARCHAR(100),
    age INT,
    grade VARCHAR(10),
    email VARCHAR(100)
)
""")



students = [
    ("John Doe", 20, "A", "john.doe@example.com"),
    ("Jane Smith", 19, "B+", "jane.smith@example.com"),
    ("Michael Johnson", 21, "A-", "michael.j@example.com"),
    ("Emily Davis", 22, "B", "emily.davis@example.com"),
    ("Chris Brown", 20, "A", "chris.brown@example.com"),
    ("Sarah Wilson", 19, "B+", "sarah.wilson@example.com"),
    ("David Jones", 23, "C+", "david.jones@example.com"),
    ("Laura Garcia", 20, "A", "laura.garcia@example.com"),
    ("Daniel Martinez", 21, "B", "daniel.martinez@example.com"),
    ("Sophia Lopez", 22, "A-", "sophia.lopez@example.com")
]

cursor.executemany("""
INSERT INTO students (name, age, grade, email)
VALUES (%s, %s, %s, %s)
""", students)

connection.commit()

# Fetch and display all students
cursor.execute("SELECT * FROM students")
for student in cursor.fetchall():
    print(student)

(1, 'John Doe', 20, 'A', 'john.doe@example.com')
(2, 'Jane Smith', 19, 'B+', 'jane.smith@example.com')
(3, 'Michael Johnson', 21, 'A-', 'michael.j@example.com')
(4, 'Emily Davis', 22, 'B', 'emily.davis@example.com')
(5, 'Chris Brown', 20, 'A', 'chris.brown@example.com')
(6, 'Sarah Wilson', 19, 'B+', 'sarah.wilson@example.com')
(7, 'David Jones', 23, 'C+', 'david.jones@example.com')
(8, 'Laura Garcia', 20, 'A', 'laura.garcia@example.com')
(9, 'Daniel Martinez', 21, 'B', 'daniel.martinez@example.com')
(10, 'Sophia Lopez', 22, 'A-', 'sophia.lopez@example.com')
(11, 'John Doe', 20, 'A', 'john.doe@example.com')
(12, 'Jane Smith', 19, 'B+', 'jane.smith@example.com')
(13, 'Michael Johnson', 21, 'A-', 'michael.j@example.com')
(14, 'Emily Davis', 22, 'B', 'emily.davis@example.com')
(15, 'Chris Brown', 20, 'A', 'chris.brown@example.com')
(16, 'Sarah Wilson', 19, 'B+', 'sarah.wilson@example.com')
(17, 'David Jones', 23, 'C+', 'david.jones@example.com')
(18, 'Laura Garcia', 20, 'A', 'laura.garcia@example.com')
(19, 'Daniel Martinez', 21, 'B', 'daniel.martinez@example.com')
(20, 'Sophia Lopez', 22, 'A-', 'sophia.lopez@example.com')

In [13]:
cursor.execute("SHOW DATABASES;")
for db in cursor.fetchall():
    print(db)

('information_schema',)
('mysql',)
('performance_schema',)
('students_db',)
('susant_db',)
('sys',)

In [14]:
cursor.execute("SHOW TABLES;")
for table in cursor.fetchall():
    print(table)

('students',)

In [15]:
cursor.execute("DESCRIBE students;")
for column in cursor.fetchall():
    print(column)

('id', 'int', 'NO', 'PRI', None, 'auto_increment')
('name', 'varchar(100)', 'YES', '', None, '')
('age', 'int', 'YES', '', None, '')
('grade', 'varchar(10)', 'YES', '', None, '')
('email', 'varchar(100)', 'YES', '', None, '')

In [16]:
cursor.execute("SHOW CREATE TABLE students;")
for row in cursor.fetchall():
    print(row)

('students', 'CREATE TABLE `students` (\n  `id` int NOT NULL AUTO_INCREMENT,\n  `name` varchar(100) DEFAULT NULL,\n  `age` int DEFAULT NULL,\n  `grade` varchar(10) DEFAULT NULL,\n  `email` varchar(100) DEFAULT NULL,\n  PRIMARY KEY (`id`)\n) ENGINE=InnoDB AUTO_INCREMENT=21 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci')

In [17]:
cursor.execute("SELECT * FROM students")
students = cursor.fetchall()

In [19]:
print("ID | Name             | Age | Grade | Email")
print("-" * 50)

ID | Name             | Age | Grade | Email
--------------------------------------------------

In [20]:
for student in students:
    print(f"{student[0]:<3} | {student[1]:<16} | {student[2]:<3} | {student[3]:<5} | {student[4]}")

1   | John Doe         | 20  | A     | john.doe@example.com
2   | Jane Smith       | 19  | B+    | jane.smith@example.com
3   | Michael Johnson  | 21  | A-    | michael.j@example.com
4   | Emily Davis      | 22  | B     | emily.davis@example.com
5   | Chris Brown      | 20  | A     | chris.brown@example.com
6   | Sarah Wilson     | 19  | B+    | sarah.wilson@example.com
7   | David Jones      | 23  | C+    | david.jones@example.com
8   | Laura Garcia     | 20  | A     | laura.garcia@example.com
9   | Daniel Martinez  | 21  | B     | daniel.martinez@example.com
10  | Sophia Lopez     | 22  | A-    | sophia.lopez@example.com
11  | John Doe         | 20  | A     | john.doe@example.com
12  | Jane Smith       | 19  | B+    | jane.smith@example.com
13  | Michael Johnson  | 21  | A-    | michael.j@example.com
14  | Emily Davis      | 22  | B     | emily.davis@example.com
15  | Chris Brown      | 20  | A     | chris.brown@example.com
16  | Sarah Wilson     | 19  | B+    | sarah.wilson@example.com
17  | David Jones      | 23  | C+    | david.jones@example.com
18  | Laura Garcia     | 20  | A     | laura.garcia@example.com
19  | Daniel Martinez  | 21  | B     | daniel.martinez@example.com
20  | Sophia Lopez     | 22  | A-    | sophia.lopez@example.com